// Generated by jextract

package raylib;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$138 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$138() {}
    static final FunctionDescriptor const$0 = FunctionDescriptor.ofVoid(
        MemoryLayout.structLayout(
            JAVA_INT.withName("vertexCount"),
            JAVA_INT.withName("triangleCount"),
            RuntimeHelper.POINTER.withName("vertices"),
            RuntimeHelper.POINTER.withName("texcoords"),
            RuntimeHelper.POINTER.withName("texcoords2"),
            RuntimeHelper.POINTER.withName("normals"),
            RuntimeHelper.POINTER.withName("tangents"),
            RuntimeHelper.POINTER.withName("colors"),
            RuntimeHelper.POINTER.withName("indices"),
            RuntimeHelper.POINTER.withName("animVertices"),
            RuntimeHelper.POINTER.withName("animNormals"),
            RuntimeHelper.POINTER.withName("boneIds"),
            RuntimeHelper.POINTER.withName("boneWeights"),
            JAVA_INT.withName("vaoId"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("vboId")
        ).withName("Mesh"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                JAVA_INT.withName("id"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("locs")
            ).withName("shader"),
            RuntimeHelper.POINTER.withName("maps"),
            MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("params")
        ).withName("Material"),
        MemoryLayout.structLayout(
            JAVA_FLOAT.withName("m0"),
            JAVA_FLOAT.withName("m4"),
            JAVA_FLOAT.withName("m8"),
            JAVA_FLOAT.withName("m12"),
            JAVA_FLOAT.withName("m1"),
            JAVA_FLOAT.withName("m5"),
            JAVA_FLOAT.withName("m9"),
            JAVA_FLOAT.withName("m13"),
            JAVA_FLOAT.withName("m2"),
            JAVA_FLOAT.withName("m6"),
            JAVA_FLOAT.withName("m10"),
            JAVA_FLOAT.withName("m14"),
            JAVA_FLOAT.withName("m3"),
            JAVA_FLOAT.withName("m7"),
            JAVA_FLOAT.withName("m11"),
            JAVA_FLOAT.withName("m15")
        ).withName("Matrix")
    );
    static final MethodHandle const$1 = RuntimeHelper.downcallHandle(
        "DrawMesh",
        constants$138.const$0
    );
    static final FunctionDescriptor const$2 = FunctionDescriptor.ofVoid(
        MemoryLayout.structLayout(
            JAVA_INT.withName("vertexCount"),
            JAVA_INT.withName("triangleCount"),
            RuntimeHelper.POINTER.withName("vertices"),
            RuntimeHelper.POINTER.withName("texcoords"),
            RuntimeHelper.POINTER.withName("texcoords2"),
            RuntimeHelper.POINTER.withName("normals"),
            RuntimeHelper.POINTER.withName("tangents"),
            RuntimeHelper.POINTER.withName("colors"),
            RuntimeHelper.POINTER.withName("indices"),
            RuntimeHelper.POINTER.withName("animVertices"),
            RuntimeHelper.POINTER.withName("animNormals"),
            RuntimeHelper.POINTER.withName("boneIds"),
            RuntimeHelper.POINTER.withName("boneWeights"),
            JAVA_INT.withName("vaoId"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("vboId")
        ).withName("Mesh"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                JAVA_INT.withName("id"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("locs")
            ).withName("shader"),
            RuntimeHelper.POINTER.withName("maps"),
            MemoryLayout.sequenceLayout(4, JAVA_FLOAT).withName("params")
        ).withName("Material"),
        RuntimeHelper.POINTER,
        JAVA_INT
    );
    static final MethodHandle const$3 = RuntimeHelper.downcallHandle(
        "DrawMeshInstanced",
        constants$138.const$2
    );
    static final FunctionDescriptor const$4 = FunctionDescriptor.of(JAVA_BOOLEAN,
        MemoryLayout.structLayout(
            JAVA_INT.withName("vertexCount"),
            JAVA_INT.withName("triangleCount"),
            RuntimeHelper.POINTER.withName("vertices"),
            RuntimeHelper.POINTER.withName("texcoords"),
            RuntimeHelper.POINTER.withName("texcoords2"),
            RuntimeHelper.POINTER.withName("normals"),
            RuntimeHelper.POINTER.withName("tangents"),
            RuntimeHelper.POINTER.withName("colors"),
            RuntimeHelper.POINTER.withName("indices"),
            RuntimeHelper.POINTER.withName("animVertices"),
            RuntimeHelper.POINTER.withName("animNormals"),
            RuntimeHelper.POINTER.withName("boneIds"),
            RuntimeHelper.POINTER.withName("boneWeights"),
            JAVA_INT.withName("vaoId"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("vboId")
        ).withName("Mesh"),
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$5 = RuntimeHelper.downcallHandle(
        "ExportMesh",
        constants$138.const$4
    );
}


